---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofToRefPlanes
source: html/6e2ffbde-bf0b-67fe-9208-eb771a06d155.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofToRefPlanes Property

Roof cannot be joined to more than one reference plane.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoofToRefPlanes { get; }
```